import { Injectable } from '@angular/core';


let News = [
  {'id': "1",
  'title':'Повна зарядка батареї за 6 хвилин і двигун розміром з атом - новини науки', 
  'category':'Technology',
  'desc':'Акумулятори нового покоління, "нанодвигун" майбутнього і як електронні сигарети шкодять організму навіть якщо не містять нікотину - в огляді наукових новин тижня.',
  'photo':'../assets/images/news1_photo.jpg'
  },
  {'id': "2",
    'title':'Електронні сигарети небезпечні навіть без нікотину', 
  'category':'Technology',
  'desc':'Куріння електронних сигарет може призвести до утворення в організмі токсичних речовин, які тимчасово знижують кровообіг і завдають шкоди кровоносним судинам. При цьому не має значення, чи містить дим, який вдихає людина, нікотин.',
  'photo':'../assets/images/news2_photo.jpg'
  },
  {'id': "3",
    'title':'Двигун розміром з атом', 
  'category':'Technology',
  'desc':'Команда фізиків з Трініті-коледжу в Дубліні оголосила про створення найменшого двигуна розміром в один атом, а точніше - іон кальцію. Це приблизно в 10 мільярдів разів менше, ніж звичайний автомобільний двигун.',
  'photo':'../assets/images/news3_photo.jpg'
  },
  {'id': "4",
    'title':'Вегани та вегетаріанці мають більший ризик інсульту', 
  'category':'Health',
  'desc':`У порівнянні з м'ясоїдами, на 1000 осіб вони мають на 10 випадків менше захворювань серця та на три більше інсультів.
  Дослідження опублікував Британський медичний журнал, воно взяло до уваги тип харчування 48 000 людей від 18 років.
  Експерти-дієтологи зазначають, що незалежно від типу харчування, вживання широкого асортименту продуктів є найкращим для здоров'я людини.`,
  'photo':'../assets/images/health1_photo.jpg'
  },
  {'id': "5",
    'title':'Бред Пітт пояснив, чому відмовився від алкоголю', 
  'category':'Health',
  'desc':`Актор Бред Пітт зробив відверте зізнання - після розлучення з Анджеліною Джолі він відмовився від алкоголю.
  Про це він розповів в інтерв'ю New York Times.
  Про розлучення подружжя стало відомо у 2016 році. Тоді у ЗМІ з'явилася інформація про те, що пара сварилася через те, що Пітт нібито зловживав алкоголем під час зйомок у стрічці Квентіна Тарантіно "Одного разу в Голлівуді".`,
  'photo':'../assets/images/health2_photo.jpg'
  },
  {'id': "6",
    'title':`Пройшли тест про здоров'я? Ваші дані вже у рекламодавців`, 
  'category':'Health',
  'desc':`Компанія Privacy International дослідила понад 100 сайтів, які стосуються психічного здоров'я, у Франції, Німеччині та Великій Британії.
  В ході дослідження експерти знайшли багато даних користувачів, доступ до яких є у третіх сторін, включаючи рекламодавців та великі технологічні компанії.
  Спосіб продажу інформації "не був прозорим, справедливим, а також часто не мав чіткої правової бази", говорить дослідження.`,
  'photo':'../assets/images/health3_photo.jpg'
  },
  
]

@Injectable({
providedIn: 'root'
})




export class DataService {
  getAll(): any[] { //Add a new method getAll()
    return News;
  }


  getByCategory(): any[] { //Add a new method getByCategory()
    let resArr = News;

    let newArr = {}
    resArr.forEach(el => {
      if(!newArr[el.category]){
        newArr[el.category] = el
      }
    })

    console.log(Object.values(newArr));
   return Object.values(newArr)
  }


constructor() { }
}

